#+TITLE: Code

* HERE IS SOME CODE

#+BEGIN_SRC python :results output
import os
import requests as req
from bs4 import BeautifulSoup as bs
import subprocess

url = 'https://worldometers.info/coronavirus/#countries'
page = req.get(url)
soup = bs(page.content, 'html.parser')
results = soup.find(id='main_table_countries_today')
results = results.text.split()

c_start = results.index('USA')
content = results[c_start:c_start + 14]

for x in content:
    print(x)


#+END_SRC

#+RESULTS:
#+begin_example
USA
6,257,938
+367
188,902
+2
3,497,431
+518
2,571,605
15,079
18,887
570
83,353,338
251,568
331,335,757
#+end_example
